add: some enhancement in the readme
